Revit 2027 API
ColorFillScheme.SortEntries Method
 Sorts the scheme entries ascending.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SortEntries()
Public Sub SortEntries
public:
void SortEntries()
member SortEntries : unit -> unit
Remarks
 If the scheme parameter value storage type is ElementId, then the order of entries would be based on the name of the elements.
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace